app/controllers/bookings_controller.rb

    def new
        @booking = Booking.new
        @room = Room.find(params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def create
        @booking = Booking.new(booking_params)
        @booking.user = current_user
        @room = Room.find(params[:room_id])
        @booking.room = @room
        if @booking.save
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "room_id", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["room_id", 9], ["start", "2022-09-28 00:00:00"], ["end", "2022-10-29 00:00:00"], ["created_at", "2022-06-30 18:09:02.914655"], ["updated_at", "2022-06-30 18:09:02.914655"]]