app/controllers/hotels_controller.rb

SELECT "rooms".* FROM "rooms"
---
    def show
        @rooms = Room.all

SELECT "hotels".* FROM "hotels"
SELECT "rooms".* FROM "rooms"
---
    def index
        @hotels = Hotel.all
        @rooms = Room.all

INSERT INTO "hotels" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Royal Palm"], ["address", "Grand Baie, Mauritius"], ["created_at", "2022-06-30 19:14:07.318606"], ["updated_at", "2022-06-30 19:14:07.318606"]]
---
    def create
        @hotel = Hotel.new(hotel_params)
        if @hotel.save

DELETE FROM "hotels" WHERE "hotels"."id" = $1  [["id", 2]]
---
    def destroy
        @hotel.destroy

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_hotel
        @hotel = Hotel.find(params[:id])