app/controllers/pages_controller.rb

  def home
    @hotels = Hotel.all
    @rooms = Room.all
---
SELECT "hotels".* FROM "hotels"
SELECT "rooms".* FROM "rooms"